<!-- X-URL: http://www.dmat.uevora.pt/~jja/icc/trabalhos.html -->
<!-- Date: Sun, 23 Jul 2000 19:15:01 GMT -->
<!-- Last-Modified: Mon, 12 Jun 2000 10:00:58 GMT -->
<BASE HREF="http://www.dmat.uevora.pt/~jja/icc/trabalhos.html">

<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Jose Alferes">
   <meta name="GENERATOR" content="Mozilla/4.71 [en] (Win98; I) [Netscape]">
   <title>Trabalhos ICC 99/00</title>
</head>
<body>

<center><b><font size=+1>Introdu&ccedil;&atilde;o &agrave; Ci&ecirc;ncia
de Computadores (1999/2000)</font></b>
<p><b><font size=+2>Temas para trabalhos</font></b></center>

<p>
<hr WIDTH="100%">
<h2>
<a NAME="t1"></a>Sub-&aacute;reas da Inform&aacute;tica</h2>
Elaborar um breve resumo sobre a divis&atilde;o da Inform&aacute;tica em
sub-&aacute;reas cient&iacute;ficas, conforme apresentada pelo <a href="http://www.acm.org/">ACM</a>.
Para cada uma das sub-&aacute;reas principais dever&atilde;o ser apresentados
os seus principais objectos de estudos.
<br>
<hr WIDTH="100%">
<h2>
<a NAME="t2"></a>Computing Curricula e Curriculum da Lic. Eng. Inform&aacute;tica
da Univ. &Eacute;vora</h2>
Estudo do documento <a href="http://www.acm.org/education/curr91/homepage.html">Computing
Curricula</a> (elaborado pelo ACM/IEEE), e an&aacute;lise do <a href="http://www.uevora.pt/graduacoes.pt.php3?op=info&id=33">Curriculum
da Licenciatura em Engenharia Inform&aacute;tica da Universidade de &Eacute;vora</a>
face a esse documento.
<br>
<hr WIDTH="100%">
<h2>
<a NAME="t3"></a>Computabilidade</h2>
Apresentar um exemplo pr&aacute;tico (distinto do <i>Halting problem</i>)
de problema n&atilde;o comput&aacute;vel, justificar porque n&atilde;o
&eacute; comput&aacute;vel e apresentar impacto pr&aacute;tico da n&atilde;o
computabilidade do problema.
<br>
<hr WIDTH="100%">
<h2>
<a NAME="t4"></a>C&aacute;lculo de complexidade de algoritmos</h2>
Apresentar dois algoritmos diferentes para a orden&ccedil;&atilde;o de
listas de num&eacute;ros e, para cada um deles, fazer um estudo t&atilde;o
detalhado quanto poss&iacute;vel da complexidade temporal e espacial.
<br>
<hr WIDTH="100%">
<h2>
<a NAME="t5"></a>Problemas de classe P e de classe NP</h2>
Fazer uma breve descri&ccedil;&atilde;o sobre o que s&atilde;o problemas
de complexidade P, NP, NP-Hard e NP-Completo, dando exemplos pr&aacute;ticos.
Discuss&atilde;o sobre o impacto de P=NP.
<br>
<hr WIDTH="100%">
<h2>
<a NAME="t6"></a>Programa&ccedil;&atilde;o em <i>Assembler</i></h2>
Usando um <a href="http://www.dmat.uevora.pt/~jja/icc/ababa.xls">interpretador
para m&aacute;quina com arquitectura de Von Neumann com 11 instru&ccedil;&otilde;es</a>,
escreva o c&oacute;digo para calcular o m&aacute;ximo divisor comum entre
dois n&uacute;meros inteiros positivos.
<br>Para aqueles que n&atilde;o se lembram de como &eacute; que se calcula
o m&aacute;ximo divisor comum, aqui v&atilde;o algumas propriedades que
poder&atilde;o ajudar na elabora&ccedil;&atilde;o de um algoritmo para
esse fim: se o resto da divis&atilde;o inteira de um n&uacute;mero <i>a</i>
por outro <i>b</i> for zero, ent&atilde;o o m&aacute;ximo divisor comum
entre <i>a</i> e <i>b</i> &eacute; o pr&oacute;prio <i>b</i>; se o resto
for um n&uacute;mero <i>r</i> (diferente de zero) ent&atilde;o o m&aacute;ximo
divisor comum entre <i>a</i> e <i>b</i> &eacute; o mesmo que o m&aacute;ximo
divisor comum entre <i>b</i> e <i>r</i>.
<br>
<hr WIDTH="100%">
<h2>
<a NAME="t7"></a>Bases de Dados</h2>
Para uma (e apenas uma) das situa&ccedil;&otilde;es abaixo, construa um
modelo de entidades e rela&ccedil;&otilde;es e sugira um conjunto de tabelas
para a representa&ccedil;&atilde;o da informa&ccedil;&atilde;o.
<br>&nbsp;
<h3>
Situa&ccedil;&atilde;o 1</h3>
Um grupo de docentes pretende organizar uma confer&ecirc;ncia e, para guardar
toda a informa&ccedil;&atilde;o relevante, vai ter que criar uma base de
dados.
<br>Na confer&ecirc;ncia s&atilde;o apresentados v&aacute;rios artigos,
cada um dos quais com um t&iacute;tulo e um n&uacute;mero. Cada artigo
tem um ou mais autores. De cada autor, pretende armazenar-se para al&eacute;m
do nome, o endere&ccedil;o de email, e o nome e morada da institui&ccedil;&atilde;o
a que est&atilde;o associados.
<br>H&aacute; ainda a informa&ccedil;&atilde;o relativa aos participantes
na confer&ecirc;ncia. De cada a participante dever&aacute; ser retida a
informa&ccedil;&atilde;o do seu nome, morada e endere&ccedil;o de email.
Al&eacute;m disso, distingue-se entre os participantes que s&atilde;o estudantes
e os que n&atilde;o s&atilde;o. Cada participante n&atilde;o estudante
tem de pagar antecipadamente a inscri&ccedil;&atilde;o por transfer&ecirc;ncia
banc&aacute;ria, pelo que &eacute; necess&aacute;rio guardar o n&uacute;mero
da transa&ccedil;&atilde;o. Para n&atilde;o pagar, o estudante tem de enviar
antecipadamente um certificado e na base de dados&nbsp; deve ser armazenado
o nome da universidade que o passou.
<br>&nbsp;
<h3>
Situa&ccedil;&atilde;o 2</h3>
Uma cl&iacute;nica m&eacute;dica pretende informatizar os seus servi&ccedil;os.
Para j&aacute; querem come&ccedil;ar por informatizar os dados referentes
a m&eacute;dicos, a clientes (ou pacientes) e a consultas.
<br>Na cl&iacute;nica trabalham v&aacute;rios m&eacute;dicos, de v&aacute;rias
especialidades diferentes. De cada m&eacute;dico, identificado internamente
por um n&uacute;mero de empregado, a cl&iacute;nica pretende armazenar
o nome, especialidade, morada e telefone.
<br>Como &eacute; usual, os m&eacute;dicos d&atilde;o consultas a clientes.
A cl&iacute;nica pretende ter sempre dispon&iacute;vel a informa&ccedil;&atilde;o
dos nomes e moradas dos seus clientes.
<br>A cada consulta est&aacute; associado um s&oacute; m&eacute;dico e
um s&oacute; cliente. Da consulta pretende armazenar-se a data em que ocorreu,
bem como os v&aacute;rios f&aacute;rmacos que foram receitados pelo m&eacute;dico
na consulta.
<br>&nbsp;
<h3>
Situa&ccedil;&atilde;o 3</h3>
Pretende-se desenvolver uma base de dados para armazenar informa&ccedil;&atilde;o
duma biblioteca. Tal base de dados dever&aacute; conter pelo menos informa&ccedil;&atilde;o
referente a:
<ul>
<li>
todos os t&iacute;tulos existentes na biblioteca incluindo,de cada um deles,
o ISBN (que &eacute; um c&oacute;digo atribuido a n&iacute;vel internacional
e que identifica univocamente um livro), o nome, o ou os autores, a editora,
os descritores do livro, a sua classifica&ccedil;&atilde;o;</li>

<li>
as localiza&ccedil;&otilde;es (e.g. o n&ordm; da prateleira) onde se devem
encontram os v&aacute;rios livros (ou exemplares) de cada um dos t&iacute;tulos;</li>

<li>
as informa&ccedil;&atilde;o relevantes sobre as editoras (como nome, telefone,
morada, fax, etc);</li>

<li>
os leitores da biblioteca, cada um dos quais com um n&ordm; de leitor.
Dos leitores, a biblioteca pretende ainda ter mais alguma informa&ccedil;&atilde;o
dispon&iacute;vel, como o nome, morada, etc;</li>

<li>
a biblioteca pretende, como &eacute; natural, ter disponivel a informa&ccedil;&atilde;o
de que leitores t&ecirc;m que livros requisitados.</li>
</ul>
<b>Nota:</b>&nbsp; Os descritores dos livros s&atilde;o como “palavras-chave”&nbsp;
que d&atilde;o indica&ccedil;&otilde;es sobre os temas abordados pelos
livros. Para uniformizar, os descritores n&atilde;o s&atilde;o livres,
mas escolhidos de entre uma lista de poss&iacute;veis descritores, sendo
cada um deles identificado por um c&oacute;digo.
<br>
<hr WIDTH="100%">
<h2>
<a NAME="t8"></a>Intelig&ecirc;ncia Artificial</h2>
Elabore um relat&oacute;rio sobre um dos seguintes temas:
<ul>
<li>
O que &eacute; a Intelig&ecirc;ncia Artificial, e suas diferen&ccedil;as
de outras &aacute;reas cient&iacute;ficas que tamb&eacute;m se preocupam
com o estudo da "intelig&ecirc;ncia".</li>

<li>
Aplica&ccedil;&otilde;es da Intelig&ecirc;ncia Artificial.</li>

<li>
A Intelig&ecirc;ncia Artificial e a sociedade do futuro.</li>
</ul>

<hr WIDTH="100%">
</body>
</html>
